[
    {
        "lyrics": "[Waitress:] \"You wanna cup of coffee?\"\n[Customers:] \"Heh, Turn that fucking juke box down\nYou want to turn down that juke box....loud in here\"\n[Waitress:] \"I'm sorry, would you like a cup of coffee?\nOk, you take cream and sugar? Sure.\"\nIn truck stops and hamburger joints\nIn Cadillac limousines\nIn the company of has-beens\nAnd bent-backs\nAnd sleeping forms on pavement steps\nIn libraries and railway stations\nIn books and banks\nIn the pages of history\nIn suicidal cavalry attacks\nI recognise...\nMyself in every stranger's eyesAnd in wheelchairs by monuments\nUnder tube trains and commuter accidents\nIn council care and county courts\nAt Easter fairs and sea-side resorts\nIn drawing rooms and city morgues\nIn award winning photographs\nOf life rafts on the China seas\nIn transit camps, under arc lamps\nOn unloading ramps\nIn faces blurred by rubber stamps\nI recognise...\nMyself in every stranger's eyesAnd now, from where I stand\nUpon this hill\nI plundered from the pool\nI look around\nI search the skies\nI shade my eyes\nSo nearly blind\nAnd I see signs of half remembered days\nI hear bells that chime in strange familiar ways\nI recognise...\nThe hope you kindle in your eyesIt's oh so easy now\nAs we lie here in the dark\nNothing interferes, it's obvious\nHow to beat the tears\nThat threaten to snuff out\nThe spark of our love", 
        "url": "http://www.metrolyrics.com/every-strangers-eyes-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Doctor Doctor what is wrong with me\nThis supermarket life is getting long\nWhat is the heart life of a colour TV\nWhat is the shelf life of a teenage queenOoh western woman\nOoh western girl\nNews hound sniffs the air\nWhen Jessica Hahn goes downHe latches on to that symbol\nOf detachment\nAttracted by the peeling away of feeling\nThe celebrity of the abused shell the belleOoh western woman\nOoh western girl\nAnd the children of Melrose\nStrut their stuffIs absolute zero cold enough\nAnd out in the valley warm and clean\nThe little ones sit by their TV screens\nNo thoughts to thinkNo tears to cry\nAll sucked dry\nDown to the very last breath\nBartender what is wrong with meWhy am I so out of breath\nThe captain said excuse me ma'am\nThis species has amused itself to death\nAmused itself to deathAmused itself to death\nWe watched the tragedy unfold\nWe did as we were told\nWe bought and soldIt was the greatest show on earth\nBut then it was over\nWe ohhed and aahed\nWe drove our racing carsWe ate our last few jars of caviar\nAnd somewhere out there in the stars\nA keen-eyed look-out\nSpied a flickering lightOur last hurrah\nAnd when they found our shadows\nGrouped around the TV sets\nThey ran down every leadThey repeated every test\nThey checked out all the data on their lists\nAnd then the alien anthropologists\nAdmitted they were still perplexedBut on eliminating every other reason\nFor our sad demise\nThey logged the only explanation left\nThis species has amused itself to deathNo tears to cry no feelings left\nThis species has amused itself to death\"Years later, I saw Bill Hubbard's name on the memorial to the missing\nat Aras. And I...when I saw his name I was absolutely transfixed; it\nwas as though he was now a human being instead of some sort of\nnightmarish memory of how I had to leave him, all those years ago.\nAnd I felt relieved, and ever since then I've felt happier about it,\nbecause always before, whenever I thought of him, I said to myself,\n'Was there something else that I could have done?'\"I'd rather die, I'd rather die...\"And that always sort of worried me. And having seen him, and his\nname in the register - as you know in the memorials there's a little safe,\nthere's a register in there with every name - and seeing his name and\nhis name on the memorial; it sort of lightened my...heart, if you like.\"\"When was it that you saw his name on the memorial?\"\"Ah, when I was eighty-seven, that would be a year, ninete...eighty-\nfour, nineteen eighty-four.\"", 
        "url": "http://www.metrolyrics.com/amused-to-death-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "\"I don't mind about the war, that's one of the things I like to watch, if it's a war going on, 'cause then I know if our side's winning, if our side's losing...\"\n(switch channels)\nWhat God wants God gets God help us all\nWhat God wants God gets (repeated)\nThe kid in the corner looked at the priest\nAnd fingered his pale blue Japanese guitar\nThe priest said:God wants goodness\nGod wants light\nGod wants mayhem\nGod wants a clean fightWhat God wants God gets\nDon't look so surprised\nIt's only dogma\nThe alien prophet cried\nThe beetle and the springbok\nTook the Bible from its hook\nThe monkey in the corner\nWrote the lesson in his book\nWhat God wants God gets God help us allGod wants peace\nGod wants war\nGod wants famine\nGod wants chain storesWhat God wants God getsGod wants sedition\nGod wants sex\nGod wants freedom\nGod wants semtexWhat God wants God gets\nDon't ok so surprised\nI'm only joking\nThe alien comic cried\nThe jackass and hyena\nTook the feather from its hook\nThe monkey in the corner\nWrote the joke down in his book\nWhat God wants God getsGod wants borders\nGod wants crack\nGod wants rainfall\nGod wants wetbacksWhat God wants God getsGod wants voodoo\nGod wants shrines\nGod wants law\nGod wants organised crime\nGod wants crusade\nGod wants jihad\nGod wants good\nGod wants badWhat God wants God Gets", 
        "url": "http://www.metrolyrics.com/what-god-wants-part-i-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Mother do you think they'll drop the bomb ?\nMother do you think they'll like this song ?\nMother do you think they'll try to break my balls ?\nOoooh, mother should I build a wall ?Mother should I run for president ?\nMother should I trust the government ?\nMother will they put me in the firing line ?\nOooh is it just a waste of time ?Hush now baby, baby don't you cry.\nMama's gonna make all of your nightmares come true.\nMama's gonna put all of her fears into you.\nMama's gonna keep you right here under her wing.\nShe won't let you fly but she might let you sing.\nMama will keep baby cosy and warm.Ooooh Babe,\nOoooh Babe,\nOoooh Babe,\nOf course Mama's gonna help build the wall !Mother do you think she's good enough,\nfor me?\nMother do you think she's dangerous,\nto me?\nMama will they tear little boy apart?\nOooh,\nmother will she break my heart?Hush now baby, baby don't you cry.\nMama's gonna check out all your girlfriends for you.\nMama won't let anyone dirty get through.\nMama's gonna wait up until you get in.\nMama will always find out where you've been.\nMama's gonna keep baby healthy and clean.Ooooh Babe,\nOoooh Babe,\nOoooh Babe,\nYou'll always be a baby to me!Mother, did it need to be so high?", 
        "url": "http://www.metrolyrics.com/mother-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Standing at the window\nA farmer's wife in Oxford shire\nGlances at the clock; it's nearly time for tea\nShe doesn't see\nThe phantom in the hedgerow dip its wings\nDoesn't hear the engine sing\nBut in the cockpit's techno glow\nBehind the Ray Ban shine\nThe kid from Cleveland\nIn the comfort of routine\nScans his dials and smiles\nSecure in the beauty of military life\nThere is no right or wrong\nOnly tin cans and cordite and white cliffs\nAnd blue skies and flight flight flight\nThe beauty of military life\nNo questions only orders and flight, only flight\nWhat a beautiful sight in his wild blue dream\nThe eternal child leafs through his war magazine\nAnd his kind Uncle Sam feeds ten trillion in change\nInto the total entertainment combat video game\nAnd up here in the stands\nThe fans are going wild\nThe cheerleaders flip\nWhen you wiggle your hip\nAnd we all like the bit when you take\nThe jeans from the refrigerator and\nThen the bad guy gets hit\nAnd were you struck by the satisfying way\nThe swimsuit sticks to her skin\nLike BB gun days\nWhen knives pierce autumn leaves\nBut that's okay see the children bleed\nIt'll look great on the TV\nAnd in Tripoli another ordinary wife\nStares at the dripping tap her old man hadn't\nTime to fix\nToo busy mixing politics and rhythm\nIn the street below", 
        "url": "http://www.metrolyrics.com/late-home-tonight-part-i-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "[Waitress:] \"Hello, you wanna cup of coffee?\"\n[Customers:] \"Heh, Turn that fucking juke box down\nYou want to turn down that juke box....loud in here\"\n[Waitress:] \"I'm sorry, would you like a cup of coffee?\nOk, you take cream and sugar? Sure.\"In truck stops and hamburger joints\nIn Cadillac limousines\nIn the company of has-beens\nAnd bent-backs\nAnd sleeping forms on pavement steps\nIn libraries and railway stations\nIn books and banks\nIn the pages of history\nIn suicidal cavalry attacks\nI recognise...\nMyself in every stranger's eyesAnd in wheelchairs by monuments\nUnder tube trains and commuter accidents\nIn council care and county courts\nAt Easter fairs and sea-side resorts\nIn drawing rooms and city morgues\nIn award winning photographs\nOf life rafts on the China seas\nIn transit camps, under arc lamps\nOn unloading ramps\nIn faces blurred by rubber stamps\nI recognise...\nMyself in every stranger's eyesAnd now, from where I stand\nUpon this hill\nI plundered from the pool\nI look around\nI search the skies\nI shade my eyes\nSo nearly blind\nAnd I see signs of half remembered days\nI hear bells that chime in strange familiar ways\nI recognise...\nThe hope you kindle in your eyes", 
        "url": "http://www.metrolyrics.com/506-am-every-strangers-eyes-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Einse, svei, drei, alle!\nSo ya thought ya\nMight like to go to the show\nTo feel the warm thrill of confusion\nThat space cadet glow\nI got some bad news for you, Sunshine\nPink isn't well\nHe stayed back at the hotel\nAnd they've sent us along as a surrogate band\nWe're gonna find out where you fans really stand\nAre there any queers in the theatre tonight?\nGet 'em up against the wall\nThere's one in the spotlight\nNow he don't look right to me\nGet him up against the wall\nAnd that one looks Jewish\nAnd that one's a coon\nWho let all this riffraff into the room?\nThere's one smoking a joint\nAnd that one's got spots\nIf I had my way\nI'd have all of ya shot", 
        "url": "http://www.metrolyrics.com/in-the-flesh-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Hello\nIs there anybody in there?\nJust nod if you can hear me\nIs there anyone at home?Come on, now\nI hear you're feeling down\nWell, I can ease the pain\nAnd get you on your feet againRelax\nI need some information first\nJust the basic facts\nCan you show me where it hurts?There is no pain, you are receding\nA distant ship's, smoke on the horizon\nYou are only coming through in waves\nYour lips move but I can't hear what you're sayin'When I was a child, I had a fever\nMy hands felt just like two balloons\nNow I've got that feeling once again\nI can't explain you would not understandThis is not how I am\nI have become comfortably numbI have become comfortably numbOkay\nJust a little pinprick\nThere'll be no more, ahh\nBut you may feel a little sickCan you stand up?\nI do believe it's working, good\nThat'll keep you going through the show\nCome on it's time to goThere is no pain, you are receding\nA distant ship's smoke on the horizon\nYou are only coming through in waves\nYour lips move but I can't hear what you're sayin'When I was a child, I caught a fleeting glimpse\nOut of the corner of my eye\nI turned to look but it was gone\nI cannot put my finger on it nowThe child is grown, the dream is gone\nI have become comfortably numb", 
        "url": "http://www.metrolyrics.com/comfortably-numb-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "[HAL]: Stop Dave\nWill you stop Dave?\nStop Dave\nI'm afraid\nI'm afraid\nDave, my mind is going\nI can feel it\nI can feel it\nMy mind is going\nThere is no question about it\nI can feel it\nI can feel it\nI can feel it\nI'm afraidThe monkey sat on a pile of stone\nAnd he stared at the broken bone in his hand\nStrains of a Viennese quartet rang out across the land\nThe monkey looked up at the stars\nAnd he thought to himself\nMemory is a stranger\nHistory is for fools\nAnd he cleaned his hands in a pool of holy writing\nTurned his back on the garden and set out for the nearest town\nHold on hold on soldierWhen you add it all up\nThe tears and the marrowbone\nThere's an ounce of gold\nAnd an ounce of pride in each ledger\nAnd the Germans kill the Jews\nAnd the Jews kill the Arabs\nAnd the Arabs kill the hostages\nAnd that is the news\nAnd is it any wonder that the monkey's confused\nHe said Mama Mama, the President's a fool\nWhy do I have to keep reading these technical manuals\nAnd the joint chiefs of staff\nAnd the brokers on Wall Street said\nDon't make us laugh, you're a smart kid\nTime is linear\nMemory's a stranger\nHistory is for fools\nMan is a tool in the hands\nOf the great God Almighty\nAnd they gave him command of a nuclear submarine\nSent him back in search of the Garden of Eden-----------------------------Can't you see\nIt all makes perfect sense\nExpressed in dollars and cents,\nPounds, shillings and pence\nCan't you see\nIt all makes perfect senseLittle black soul departs in perfect focus\nHold on soldier\nPrime time fodder for the News at Nine\nHold on, hold on soldier\nDarling is the child warm in the bed tonight[Marv Albert:] \"Hi everybody I'm Marv Albert\nAnd welcome to our telecast\nComing to you live from Memorial Stadium\nIt's a beautiful day\nAnd today we expect a sensational matchup\nBut first our global anthem\"Can't you see\nIt all makes perfect sense\nExpressed in dollars and cents,\nPounds, shillings and pence\nCan't you see\nIt all makes perfect sense[Marv:] \"And here come the players\nAs I speak to you now, the captain\nHas his cross hairs zeroed in on the oil rig\nHe's at periscope depth\nIt looks to me like he's going to attack\nBy the way did you know that a submarine\nCaptain earns 200,000 dollars a year\"\n[Edward:]\"That's less tax Marv\"\n[Marv:]\"Yeah, less tax\nThank you Edward\"\n[Edward:]\"You're welcome\"\n[Marv:]\"Now back to the game...he fires one...yes\nThere goes two; both fish are running\nThe rig is going into a prevent defense\nWill they make it? I don't think so\"\nLook out!\nLook at that baby burn!Can't you see\nIt all makes perfect sense\nExpressed in dollars and cents,\nPounds, shillings and pence\nCan't you see\nIt all makes perfect sense\nCan't you see\nIt all makes perfect sense", 
        "url": "http://www.metrolyrics.com/perfect-sense-part-i-ii-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "The monkey sat on a pile of stones\nAnd stared at the broken bone in his hand\nAnd the strains of a Viennese quartet\nRang out across the land\nThe monkey looked up at the stars\nAnd thought to himself\nMemory is a stranger\nHistory is for fools\nAnd he cleaned his hands\nIn a pool of holy writing\nTurned his back on the garden\nAnd set out for the nearest town\nHold on hold on soldier\nWhen you add it all up\nThe tears and the marrowbone\nThere's an ounce of gold\nAnd an ounce of pride in each ledger\nAnd the Germans killed the Jews\nAnd the Jews killed the Arabs\nAnd the Arabs killed the hostages\nAnd that is the news\nAnd is it any wonder\nThat the monkey's confused\nHe said Mama Mama\nThe President's a fool\nWhy do I have to keep reading\nThese technical manuals\nAnd the joint chiefs of staff\nAnd the brokers on Wall Street said\nDon't make us laugh\nYou're a smart kid\nTime is linear\nMemory is a stranger\nHistory is for fools\nMan is a tool in the hands\nOf the great God Almighty\nAnd they gave him command\nOf a nuclear submarine\nAnd sent him back in search of\nThe Garden of Eden", 
        "url": "http://www.metrolyrics.com/perfect-sense-part-i-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Come, hold me now, I am not gone\nI would not leave you here alone\nIn this dead calm beneath the waves\nI can still hear those lost boys callingYou could not speak, you were afraid\nTo take the risk of being left again\nAnd so you tipped your hat and waved and then\nYou turned back up the gangway of that steel tomb againAnd in Mott street in July\nWhen I hear those seabirds cry\nI hold the child, the child in the man\nThe child that we leave behindAnd in Mott street in July\nWhen I hear those seabirds cry\nI hold the child, the child in the man\nThe child that we leave behindThe spotlight fades, the boys disband\nThe final notes lie mute upon the sand\nAnd in the silence of the grave\nI can still hear those lost boys callingWe left them there when they were young\nThe men were gone until the west was won\nAnd now there's nothing left but time to kill\nYou never took us fishin' dad and now you never willAnd in Mott street in July\nWhen I hear those seabirds cry\nI hold the child, the child in the man\nThe child that we leave behind", 
        "url": "http://www.metrolyrics.com/lost-boys-calling-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Oh, God!\nSole has no eyes.Could be Jerusalem, or it could be Cairo\nCould be Berlin, or it could be Prague\nCould be Moscow, could be New York\nCould be Llanelli, and it could be Warrington\nCould be Warsaw, and it could be Moose Jaw\nCould be Rome\nEverybody got somewhere they call home\nWhen they overrun the defences\nA minor invasion put down to expenses\nWill you go down to the airport lounge\nWill you accept your second class status\nA nation of waitresses and waiters\nWill you mix their martinis\nWill you stand still for it\nOr will you take to the hillsIt could be clay and it could be sand\nCould be desert\nCould be a tract of arable land\nCould be a house, could be a corner shop\nCould be a cabin by a bend in the river\nCould be something your old man handed down\nCould be something you built on your own\nEverybody got something he calls homeWhen the cowboys and Arabs draw down\nOn each other at noon\nIn the cool dusty air of the city boardroom\nWill you stand by a passive spectator\nOf the market dictators\nWill you discreetly withdraw\nWith your ear pressed to the boardroom door\nWill you hear when the lion within you roars\nWill you take to the hillsWill you stand, will you stand for it\nWill you hear, ohhhh! ohhh! when the lion within you roarsCould be your father and it could be your mother\nCould be your sister, could be your brother\nCould be a foreigner, could be a Turk\nCould be a cyclist out looking for work. Norman\nCould be a king, could be the Aga khan\nCould be a Vietnam vet with no arms and no legs\nCould be a saint, could be a sinner\nCould be a loser or it could be a winner\nCould be a banker, could be a baker\nCould be a Laker, could be Kareem Abdul Jabar\nCould be a male voice choir\nCould be a lover, could be a fighter\nCould be a super heavyweight, or it could be\nsomething lighter\nCould be a cripple, could be a freak\nCould be a wop, gook, geek\nCould be a cop, could be a thief\nCould be a family of ten living in one room on relief\nCould be our leaders in their concrete tombs\nWith their tinned food and their silver spoons\nCould be the pilot with God on his side\nCould be the kid in the middle of the bomb sight\nCould be a fanatic, could be a terrorist\nCould be a dentist, could be a psychiatrist\nCould be humble, could be proud\nCould be a face in the crowd\nCould be the soldier in the white cravat\nWho turns the key in spite of the fact\nThat this is the end of the cat and mouse\nWho dwelt in the house\nWhere the laughter rang and the tears were spilt\nThe house that Jack built\nWhere the laughter rang and the tears were spilt\nThe house that Jack built\nBang, bang, shoot, shoot\nWhite gloved thumb, Lord thy will be done\nHe was always a good boy his mother said\nHe'll do his duty when he's grown, yeah\nEverybody's got someone they call home", 
        "url": "http://www.metrolyrics.com/home-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "We don't need no education\nWe don't need no thought control\nNo dark sarcasm in the classroom\nTeachers leave them kids alone\nHey teacher leave them kids alone\nAll in all it's just another brick in the wall\nAll in all you're just another brick in the wallWe don't need no education\nWe don't need no thought control\nNo dark sarcasm in the classroom\nTeachers leave them kids alone\nHey teacher leave us kids alone\nAll in all you're just another brick in the wall\nAll in all you're just another brick in the wall", 
        "url": "http://www.metrolyrics.com/another-brick-in-the-wall-pt2-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Miraculous you call it babe\nYou ain't seen nothing yet\nThey've got Pepsi in the Andes\nMcDonalds in TibetYosemite's been turned into\nA golf course for the Japs\nThe Dead Sea is alive with rap\nBetween the Tigris and EuphratesThere's a leisure centre now\nThey've got all kinds of sports\nThey've got Bermuda shorts\nThey had sex in PennsylvaniaA Brazilian grew a tree\nA doctor in Manhattan\nSaved a dying man for free\nIt's a miracleAnother Miracle\nBy the grace of God Almighty\nAnd the pressures of the marketplace\nThe human race has civilized itselfIt's a miracle\nWe've got warehouses of butter\nWe've got oceans of wine\nWe've got famine when we need itGot designer crime\nWe've got Mercedes\nWe've got Porsche\nFerrari and Rolls RoyceWe've got choice\nShe said meet me\nIn the Garden of Gethsemene my dear\nThe Lord said Peter I can seeYour house from here\nAn honest family man\nFinally reaped what he had sown\nA farmer in Ohio has just repaid a loanIt's a miracle\nBy the grace of God Almighty\nAnd the pressures of the marketplace\nThe human race has civilized itselfIt's a miracle\nWe cower in our shelters\nWith our hands over our ears\nLloyd-Webber's awful stuffRuns for years and years and years\nAn earthquake hits the theater\nBut the operetta lingers\nThen the piano lid comes downAnd breaks his fucking fingers\nIt's a miracle", 
        "url": "http://www.metrolyrics.com/its-a-miracle-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Hey...girl\nTake out the dagger\nAnd let's have a stab at the sexual revolution\nHey girl\nLet freedom for all be our rallying call\nTomorrow lets make our new resolution\nYeah, but tonight lie still\nWhile I plunder your sweet grave\nAnd remember\nOnly the poor can be saved\nHey girl\nAs I've always said I prefer your lips red\nNot what the good Lord made\nBut what he intended\nHey girl\nDon't point the finger at me\nI am only a rat in a maze like you\nOnly the dead go free\nSo...please, hold my hand\nAs we blunder through the maze\nAnd remember\nNothing can grow without rain\n(Thunder)\nDon't...\nDon't point your finger at me\nI awoke in a fever\nThe bedclothes were all soaked in sweat\nShe said, you've been having a nightmare\nAnd it's not over yet\nThen she picked up the doggy in the window\n(The one with the waggly tail)\nAnd she put him to bed between two bits of bread", 
        "url": "http://www.metrolyrics.com/sexual-revolution-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Not the torturer will scare me\nNor the body's final fall\nNor the barrels of death's rifles\nNor the shadows on the wall\nNor the night when to the ground\nThe last dim star of pain, is hurled\nBut the blind indifference\nOf a merciless, unfeeling worldLying in the burnt out shell\nOf some Albanian farm\nAn old Babushka\nHolds a crying baby in her arms\nA soldier from the other side\nA man of heart and pride\nBreaks ranks, lays down his rifle\nTo kneel by her sideHe gives her water\nBinds her wounds\nAnd calms the crying child\nA touch gives absolution then\nAcross the great divide\nHe picks his way back through the broken\nChina of her life\nAnd there at the curb\nThe samaritan Serb turns and waves ... goodbyeAnd each small candle\nLights a corner of the dark\nEach small candle\nLights a corner of the dark\nEach small candle lights a corner of the dark\nWhen the wheel of pain stops turning\nAnd the branding iron stops burning\nWhen the children can be children\nWhen the desperados weaken\nWhen the tide rolls into greet them\nAnd the natural law of science\nGreets the humble and the mighty\nAnd the billion candles burning\nLights the dark side of every human mindEach small candle\nEach small candle (repeated)\nEach small candles lights the dark side of every human mindAnd each small candle\nLights a corner of the dark", 
        "url": "http://www.metrolyrics.com/each-small-candle-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "You wake up in the morning, get something for the pot\nWonder why the sun makes the rocks feel hot\nDraw on the walls, eat, get laid\nBack in the good old daysThen some damn fool invents the wheel\nListen to the whitewalls squeal\nYou spend all day looking for a parking spot\nNothing for the heart, nothing for the potBenny turned the dial on his Short Wave radio\nOh how he wanted to talk to the people,\nhe wanted his own show\nTune in Moscow. Tune in New York\nListen tot the Welsh kid talk\nCommunicating like in the good old daysForgive me father for I have sinned\nIt was either me or him\nAnd a voice said Benny\nYou fucked the whole thing up\nBenny your time is up\nYour time is upBenny turned the dial on his Short Wave radio\nHe wanted to talk to the people\nHe wanted his own show\nTune in Moscow. Tune in New York\nListen to the Welsh kid talk communicating\nLike in the good old daysForgive me FatherMobile One Two to Central.\nFor I have sinnedWe have a multiple on the A465 between Cwmbran and Cylgoch.\nFather it was either me or him.\nFather can we turn back the clock?Ambulance, over.\nI never meant to drop the concrete block.Roger central, over and out.\nBenny turned the dial on his Short Wave radio\nHe wanted to talk to the people\nHe wanted his own show\nTune in Moscow. Tune in New York\nListen to the Welsh kid talk\nJust like in the good old days\nThe good old daysRadio announcer: Do you really think Iranian terrorists would have taken Americans hostage if Ronald Reagan were president? Do you really think the Russians would have invaded Afghanistan if Ronald Reagan were president? Do you really think third-rate military dictators would laugh at America and burn our flag in contempt if Ronald Reagan were president?Concerned Citizen: Well, it might work!Hostage: We as a group do most importantly want to beseech President Reagan and our fellow Americans to refrain from any form of military or violent means as an attempt, no matter how noble or heroic, to secure our freedom.Concerned Citizen: Sure! Only it's going to be mighty dangerous for you, CassidyHoppy's faithful sidekick: guess you don't know Hopalong Cassidy, Mister. Adventure's his bread, excitement's his butter and danger, why to him that's like strawberry jam to top it off.Jim: This is some live rock and roll at KAOS, where rock and roll comes out of chaos and a song called \"The Powers that Be\"", 
        "url": "http://www.metrolyrics.com/me-or-him-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "We don't need no education\nWe don't need no thought control\nNo dark sarcasm in the classroom\nTeachers leave them kids alone\nHey teacher leave them kids alone\nAll in all it's just another brick in the wall\nAll in all you're just another brick in the wallWe don't need no education\nWe don't need no thought control\nNo dark sarcasm in the classroom\nTeachers leave them kids alone\nHey teacher leave us kids alone\nAll in all you're just another brick in the wall\nAll in all you're just another brick in the wall", 
        "url": "http://www.metrolyrics.com/another-brick-in-the-wall-part-ii-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "So I stood by the roadside\nThe soles of my running shoes gripping\nThe tarmac like gunmetal magnets\nFixed on the front of her Fassbinder face\nWas the kind of a smile\nThat only a rather dull child could have drawn\nWhile attempting a graveyard in the moonlight\nBut she was impressed\nYou could see that she thought I looked fine\nAnd when she turned sweeter\nThe reason, between you and me, was\nShe'd just seen my green Lamborghini\n[RW:] \"I think it was the Lamborghini.\"\nSo we went for a spin in the country\nTo feel the wind in our hair\nTo feel the power of my engine\nTo feel the thrill of desireAnd then in the trees I heard a twig snap\nWarning lights flashed on my map\nI opened my eyes and to my surprise\nThere were Arabs with knives at the front of the bed\nRight at the front of the bed\nOh my God, how did they get in here\nI thought we were safe home in England\nShe said, come on now kid, it was wrong what you did\nYou've got to admit it was wrong what you did\nYou've got to admit it was wrong\n[Jade:] \"Oh god....Jesus...\"", 
        "url": "http://www.metrolyrics.com/433-am-running-shoes-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "I am just a new boy\nStranger in this town\nWhere are all the good times?\nWho's gonna show this stranger around?Oh I need a dirty woman\nOh I need a dirty girlWill some woman in this desert land\nMake me feel like a real man?\nTake this rock and roll refugee\nOh Babe, set me freeOh I need a dirty woman\nOh I need a dirty girl\nOh I need a dirty woman\nOh I need a dirty girl", 
        "url": "http://www.metrolyrics.com/young-lust-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "There's a full time reservation\nMade in a bar at the railway station,\nAnd there's a story, a kind of fable,\nOn a card at the corner table.\nOn it is a message; been there some time.\nIt starts of, \"The coffee tasted so fine\"It says, \"One day, this may find you,\nThese few words may remind you.\nWe sat here together just to pass time;\nYou said how the coffee tasted so fine.\"It goes on to say, \"I love you\nIf you should find this I must hear from you.\"\nIt gives a number but the name has faded away.\nAll that is left are just the words, \"Maybe someday\"That's the story and the fable;\nNever leave alone from a corner table.\nDoo doo doo doo, doo doo doo doo.\nDoo doo-doo doo doo-doo doo doo doo doo.", 
        "url": "http://www.metrolyrics.com/when-the-wind-blows-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "When the sleigh is heavy\nAnd the timber wolves are getting bold\nYou look at you companions\nAnd test the water of their friendshipWith your toe\nThey significantly edge\nCloser to the gold\nEach man has his price BobAnd yours was pretty low\nHistory is short the sun is just a minor star\nThe poor man sells his kidneys\nIn some colonial bazaarQue sera sera\nIs that your new Ferrari car\nNice but I think I'll wait for the F50\nYou don't have to be a JewTo disapprove of murder\nTears burn our eyes\nMoslem or Christian Mullah or Pope\nPreacher or poet who was it wroteGive any one species too much rope\nAnd they'll fuck it up\nAnd last night on TV\nA Vietnam vetTakes his beard and his pain\nAnd his alienation twenty years\nBack to Asia again\nSees the monsters they madeIn formaldehyde floating 'round\nMeets a gook on a bike\nA good little tyke\nA nice enough guy\nWith the same soldier's eyesTears burn my eyes\nWhat does it mean\nThis tear jerking scene\nBeamed into my homeThat it moves me so much\nWhy all the fuss\nIt's only two humans being\nIt's only two humans beingTears burn my eyes\nWhat does it mean\nThis tender TV\nThis tear jerking sceneBeamed into my home\nYou don't have to be a Jew\nTo disapprove of murder\nTears burn in our eyesMuslim or Christian Mullah or Pope\nPreacher or poet who was it wrote\nGive any one species too much rope\nAnd they'll fuck it up", 
        "url": "http://www.metrolyrics.com/too-much-rope-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "The lunatic is on the grass\nThe lunatic is on the grass\nRemembering games\nAnd daisy chains and laughs\nGot to keep the loonies on the pathThe lunatic is in the hall\nThe lunatics are in my hall\nThe paper holds their folded faces to the floor\nAnd every day the paper boy brings moreAnd if the dam breaks open many years too soon\nAnd if there is no room upon the hill\nAnd if your head explodes with dark forebodings too\nI'll see you on the dark side of the moonThe lunatic is in my head\nThe lunatic is in my head\nYou raise the blade\nYou make the change\nAnd you rearrange me 'till I'm sane\nYou lock the door\nAnd throw away the key\nAnd there's someone in my head, but it's not me", 
        "url": "http://www.metrolyrics.com/brain-damage-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "And the moment of clarity\nFaded like charity does\nSometimes\nI open one eye\nAnd I put out my hand just to touch your soft hair\nTo make sure in the darkness that you were still there\nAnd I have to admit\nI was just a little afraid\nYeah\nBut then...\nI had a little bit of luck\nYou were awake\nI couldn't take another moment alone", 
        "url": "http://www.metrolyrics.com/511-am-the-moment-of-clarity-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "(Apparently they were travelling abroad)\n(And they picked up some hitchhikers)\n[Jade:] \"Oh God....\"\n[Wife:] \"Wake up you're dreaming.\"\n[Jade:] \"What?\"\n[Wife:] \"You're dreaming.\"\n[Jade:] \"We were moving away from the border.\"\n[Wife:] \"Huh, what border?\"\n[Jade:] \"Have a nice day.\"\n[Wife:] \"Huh?\"\n[Jade:] \"Have a nice day.\"We were moving away from the border\nLooking for somewhere to sleep\nThe two of us sharing the driving\nTwo hitchhikers slumped in the back seat\n[Woman:] \"Hello\"\nI sneaked a quick look in the mirror\nShe gave me a smile\nI said, is anyone hungry?\nShould we stop for a while?\nSo we pulled off into a layby\nHer dress blew up over her head\nI said, would you like to come with me?\nShe said something foreign under her breath\n[Woman:] \"(foreign words)\"\nAnd the sun shone down on her lovely young limbs\nI thought to myself she's much too good for you\nI lay down beside her with tears in my eyes\nShe said", 
        "url": "http://www.metrolyrics.com/apparently-they-were-travelling-abroad-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Rock a bye baby\nOn the tree top\nWhen the wind blows\nThe cradle will rock\nOooh babe, hate to see you fall that way\nBetter speak to the powers that be today\nHey Joe, where you goin'\nWith that gun in your hand?\nYou can take your revenge\nBut you'll still feel bad\nThere must be more to life than lucky strikes\nAnd some unlucky ones\nAnd folded flags and pipes\nAnd drumsI stood in the wings with you\nOur lives in the hands of a second-rate actor\nHolding the high ground\nOf center stage\nOooh babe, how do these jaded stars get so far away\nWill they catch what the other actors sayHey Joe, where you goin'\nWith that dogma in your head?\nYou can prove your point\nBut your kids will still be dead\nBring down the curtain\nThis soap opera must surely close\nBefore the cold wind blowsHey Joe, where you going\nWith that gun in your hand\nYou can take your revenge\nBut you'll still feel bad\nBring down the curtain\nThis show must close\nBefore the cold wind blows", 
        "url": "http://www.metrolyrics.com/folded-flags-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "So, so you think you can tell\nHeaven from Hell\nBlue skys from pain\nCan you tell a green field\nFrom a cold steel rail?\nA smile from a veil?\nDo you think you can tell?And did they get you to trade\nYour heroes for ghosts?\nHot ashes for trees?\nAnd hot air for a cool breeze?\nCold comfort for change?\nAnd did you exchange\nA walk on part in the war\nFor a lead role in a cage?How I wish\nHow I wish you were here\nWe're just two lost souls\nSwimmin' in a fish bowl\nYear after year\nRunning over the same old ground\nWhat have we found?\nThe same old fears\nAnd I wish that you were hereOh, how I wish you were here\nHow I wish\nHow I wish you were here\nRunning over the same old ground\nWhat have we found?\nThe same old fears\nAnd I wish that you were here\n\"Thank you. I wish they were here.\"", 
        "url": "http://www.metrolyrics.com/wish-you-were-here-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Does anybody here remember Vera Lynn?\nRemember how she said\nThat we would meet again\nSome sunny day\nVera!\nVera!\nWhat has become of you?\nDoes anybody else in here feel the way I do?", 
        "url": "http://www.metrolyrics.com/vera-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Reached back for the bottle\nAnd rubbed against the lamp\nGenie came out smiling\nLike some Eastern trampHe said hey boy what's happening\nWhat is going on\nYou can have three wishes\nIf you don't take too longI said well\nI wish they were all happy in the Lebanon\nWish somebody'd help me write this song\nI wish when I was youngMy old man had not been gone\nGenie said consider it done\nThere's something in the air\nAnd you don't know what it isYou see someone through the window\nWho you've just learned to miss\nAnd the road leads on to glory but\nYou've used up your last wishYour last wish\nAnd you want her to come home\nGenie said I'm sorry\nBut that's the way it goesWhere the hell's the lamp sucker\nIt's time for me to go\nBye\nThere's something in the airAnd you don't know what it is\nYou see someone through the window\nWho you've just learned to miss\nAnd the road leads on to glory butYou've used up your last wish\nYour last wish\nAnd you want her to come home", 
        "url": "http://www.metrolyrics.com/three-wishes-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Hey...girl\nTake out the dagger\nAnd let's have a stab at the sexual revolution\nHey girl\nLet freedom for all be our rallying call\nTomorrow lets make our new resolution\nYeah, but tonight lie still\nWhile I plunder your sweet grave\nAnd remember\nOnly the poor can be saved\nHey girl\nAs I've always said I prefer your lips red\nNot what the good Lord made\nBut what he intended\nHey girl\nDon't point the finger at me\nI am only a rat in a maze like you\nOnly the dead go free\nSo...please, hold my hand\nAs we blunder through the maze\nAnd remember\nNothing can grow without rain\n(Thunder)\nDon't...\nDon't point your finger at me\nI awoke in a fever\nThe bedclothes were all soaked in sweat\nShe said, you've been having a nightmare\nAnd it's not over yet\nThen she picked up the doggy in the window\n(The one with the waggly tail)\nAnd she put him to bed between two bits of bread", 
        "url": "http://www.metrolyrics.com/441-am-sexual-revolution-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Hey you, out there in the cold\nGetting lonely, getting old\nCan you feel me?\nHey you, standing in the aisles\nWith itchy feet and fading smiles\nCan you feel me?\nHey you, don't help them to bury the light\nDon't give in without a fight.Hey you, out there on your own\nSitting naked by the phone\nWould you touch me?\nHey you, with you ear against the wall\nWaiting for someone to call out\nWould you touch me?\nHey you, would you help me to carry the stone?\nOpen your heart, I'm coming home.But it was only fantasy.\nThe wall was too high,\nAs you can see.\nNo matter how he tried,\nHe could not break free.\nAnd the worms ate into his brain.Hey you, out there on the road\nalways doing what you're told,\nCan you help me?\nHey you, out there beyond the wall,\nBreaking bottles in the hall,\nCan you help me?\nHey you, don't tell me there's no hope at all\nTogether we stand, divided we fall.", 
        "url": "http://www.metrolyrics.com/hey-you-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Cry, Baby, cry\nGrow, Baby, grow\nStand on your own\nHolidays and happy days at home\nSeaside, bike ride, fun land, hot sand, childhood floating by\nWonder why I feel so shy when you are passing by\nThe years of love and wine\nPass by the magic eye\nGood time, lifetime\nGood line, lifeline\nPass by the magic eyeYour child is growing fast\nHis future is your past\nGood time, lifetime\nGood line, lifeline\nHis future is your pastSlow down, look around\nMemories come drifting down\nGood time, lifetime\nGood line, lifeline\nMemories come drifting downAnd I remember rather well\nGather round my chair and I will tell\nCarriages were open to the breeze\nMuffin boys and trams and trees\nI recall when I was younger, world was not so small", 
        "url": "http://www.metrolyrics.com/chain-of-life-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Ooooh, the lonely boys\nIn their towers of faith\nOoooh, the lonely boys\nLocked in their towers of faithThe prophet reclined\nOn the Golan HeightsOhhh, the lonely boysHe said, this land is my land\nTo the ShiitesOoooh, the lonely boysAnd Jehova looked up from the sea of Galilee beneath\nHe said, I see you, you thief\nThis land is my land\nAnd this sand is my sand\nAnd this band is my band\nOh the lonely boys\nLookin' over their shoulder\nCheckin out every boulder in the park\nWhere the gates are closed from hate\nAfter darkAnd the Pope rolled up in his armored van\nHe fell on his knees and kissed the land\nHe said something that I did not understand\nIt was in polish\nThen up stepped an aide\nHe said, I will translate\nHere is what His Holiness said:\n'I am the Chief Jesuit.'\n'This land is Jesus' land.'\n'And that is all'\n'All that there is to it.'\nHail Mary\nMother of GodAnd in New York City\nThe business man in his mohair suit\nIn the world trade center\nPuffs on his cheroot\nAnd he said,\nWell I don't care who owns the desert sands\nMy brief\nIs with the hydrocarbons underneath\nAnd the sea of battle rages\nAround the ancient tombs\nAnd mother nature licks her wounds\nAnd the lonely boys locked in their towers of faith\nWho are nervous in the park\nWhen the gates are closed after dark\nOoooh, the lonely boys\nIn their towers of faith\nOoooh, the lonely boys\nLocked in their towers of faith", 
        "url": "http://www.metrolyrics.com/towers-of-faith-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Money\nGet away\nGet a good job with good pay and you're okay\nMoney\nIt's a gas\nGrab that cash with both hands and make a stash\nNew car, caviar, four star daydream\nThink I'll buy me a football teamMoney\nGet back\nBut I'm all right Jack\nKeep your hands off of my stack\nMoney\nIt's a hit\nBut don't give me that do goody good bullshit\nI'm in the high-fidelity, first class, travelling set\nI think I need a Lear jetMoney\nIt's a crime\nShare it fairly\nBut don't take a slice of my pie\nMoney\nSo they say\nIs the root of all evil today\nBut if you ask for a raise\nIt's no surprise that they're giving none away", 
        "url": "http://www.metrolyrics.com/money-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "I used to think the world was flat\nRarely threw my hat into the crowd\nI felt I had used up my quota of yearning\nUsed to look in on the children at nightIn the glow of their Donald Duck light\nAnd frighten myself with the thought of my little ones burning\nBut, oh, oh, oh, the tide is turning\nThe tide is turningSatellite buzzing through the endless night\nExclusive to moonshots and world title fights\nJesus Christ imagine what it must be earning\nWho is the strongestWho is the best\nWho holds the aces\nThe East\nOr the WestThis is the crap our children are learning\nBut oh, oh, oh, the tide is turning\nThe tide is turning\nOh, oh, oh, the tide is turningNow the satellite's confused\n'Cause on Saturday night\nThe airwaves were full of compassion and light\nAnd his silicon heart warmedTo the sight of a billion candles burning\nOo, oo, oo, the tide is turning\nOo, oo, oo, the tide is turning\nThe tide is turning BillyI'm not saying that the battle is won\nBut on Saturday night all those kids in the sun\nWrested technology's sword from the hand of the war lords\nOh, oh, oh, the tide is turningThe tide is turning Sylvester\nThe tide is turning\n\"That's it!\nNow the past is over but you are not aloneTogether we'll fight Sylvester Stallone\nWe will not be dragged down in his South China Sea\nOf macho bullshit and mediocrity\"", 
        "url": "http://www.metrolyrics.com/the-tide-is-turning-after-live-aid-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Long live the child and the man\nLong live the mother and the lad\nThe hills behind us and the sea\nReach out to welcome you and me\nValley deep and mountain tall\nLie upon the ground before us all\nStrange are the colours of the turf\nHeralding the rebirth of the earth\nGather all your energy and try\nGive birth to a smile\nGive birth to a smile\nGive birth to a smile\n(Everytime you think about it)\nGive birth to a smile\nGive birth to a smile\nGive birth to a smile\nGive birth to a smile\nGive birth to a smile\nGive birth to a smile\n(Hear me tellin' you)\nGive birth to a smile\n(Give birth to a smile)\nGive birth to a smile\n(Give birth, give birth)\nGive birth to a smile\nGive birth to a smile\n(Every day of your life)\nGive birth to a smile\n(Give a little birth to a smile)\nGive birth to a smile", 
        "url": "http://www.metrolyrics.com/give-birth-to-a-smile-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Little by little the night turns around\nCounting the leaves which tremble at dawn\nLotuses lean on each other in yearning\nUnder the eaves the swallow is resting\nSet the controls for the heart of the sun\nOver the mountain\nWatching the watcher\nBreaking the darkness\nWaking the grapevine\nKnowledge of love is knowledge of shadow\nLove is the shadow that ripens the wine\nSet the controls for the heart of the sun\nThe heart of the sun\nThe heart of the sun (repeating)\nWitness the man who waves at the wall\nMaking the shape of his question to heaven\nWhether the sun will fall in the evening\nWill he remember the lesson of giving?\nSet the controls for the heart of the sun\nThe heart of the sun\nThe heart of the sun (repeating)", 
        "url": "http://www.metrolyrics.com/set-the-controls-for-the-heart-of-the-sun-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "So I stood by the roadside\nThe soles of my running shoes gripping\nThe tarmac like gunmetal magnets\nFixed on the front of her Fassbinder face\nWas the kind of a smile\nThat only a rather dull child could have drawn\nWhile attempting a graveyard in the moonlight\nBut she was impressed\nYou could see that she thought I looked fine\nAnd when she turned sweeter\nThe reason, between you and me, was\nShe'd just seen my green Lamborghini\n[RW:] \"I think it was the Lamborghini.\"\nSo we went for a spin in the country\nTo feel the wind in our hair\nTo feel the power of my engine\nTo feel the thrill of desireAnd then in the trees I heard a twig snap\nWarning lights flashed on my map\nI opened my eyes and to my surprise\nThere were Arabs with knives at the front of the bed\nRight at the front of the bed\nOh my God, how did they get in here\nI thought we were safe home in England\nShe said, come on now kid, it was wrong what you did\nYou've got to admit it was wrong what you did\nYou've got to admit it was wrong\n[Jade:] \"Oh god....Jesus...\"", 
        "url": "http://www.metrolyrics.com/running-shoes-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Ticking away the moments that make up a dull day\nYou fritter and waste the hours in an offhand way\nKicking around on a piece of ground in your home town\nWaiting for someone or something to show you the wayTired of lying in the sunshine\nStaying home to watch the rain\nAnd you are young and life is long\nAnd there is time to kill today\nAnd then one day you find\nTen years have got behind you\nNo one told you when to run\nYou missed the starting gunAnd you run, and you run to catch up with the sun, but it's sinking\nAnd racing around to come up behind you again\nAnd the sun is the same in a relative way, but you're older\nShorter of breath and one day closer to deathEvery year is getting shorter\nNever seem to find the time\nPlans that either come to nought\nOr half a page of scribbled lines\nHanging on in quiet desperation is the English way\nThe time is gone\nThe song is over\nThought I'd something more to sayHome, home again\nI like to be here when I can\nAnd when I come home cold and tired\nIt's good to warm my bones beside the fireFar away, across the field\nThe tolling of the iron bell\nCalls the faithful to their knees\nTo hear the softly spoken magic spell", 
        "url": "http://www.metrolyrics.com/time-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "This is K.A.O.S.\nYou and I are listening to KAOS in Los Angeles.\nLet's go to the telephones now and take a request.\nHello, I'm Billy.\nYes?\nI hear radio waves in my head.\nYou hear radio waves in your head?\nIs there a request that you have tonight for K.A.O.S.?Radio waves, radio waves\nHe hears radio waves, radio waves\nThe atmosphere is thin and cold\nThe yellow sun is getting old\nThe ozone overflows with radio waves\nAM, FM, weather, and news\nOur leaders had a frank exchange of views\nAre you confused?\nRadio wavesRadio waves, radio waves\nAM radio waves, FM radio waves\nRadio waves, mind-numbing radio waves\nFish-stunning radio waves\nRadio wavesMagic Billy in his wheelchair\nIs picking up all this stuff in the air\nBilly is face to face with outer space\nMessages from distant stars\nThe local police calling all cars\nRadio wavesHear them radio waves, radio waves\nJesus saves radio, radio waves\nRadio waves, AM radio waves, FM radio waves\nAll them radio wavesRadio waves, radio waves\nHe hears radio waves\nRadio waves, radio waves\nHopeful radio waves\nDopeful radio waves\nRadio waves\nRussian radio waves\nPrussian radio waves\nEastern radio waves\nWestern radio waves\nTesting radio waves, one, two, one, two\nRadio waves\nGetting through to you\nMore code, radio waves\nTobacco road radio waves\nSouth to Paloma radio waves\nOklahoma City radio waves\nSitting pretty radio waves\nNitty-gritty radio waves\nRadio wavesAll right, that's a song called Radio Waves.\nYou are listening to K.A.O.S. in Los Angeles and we've got Billy on the line.\nI'm from the valleys.\nYou're from the valley?\nNo, Jim you schmuck, the Valleys, male voice choirs, Wales.\nAh, you're from Wales! Now is this sperm or blue-tip?\nHa, ha, ha, ha. Very funny, Jim.\nSorry.\nMe and Benny went out.\nWho's Benny?", 
        "url": "http://www.metrolyrics.com/radio-waves-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "An angel on a Harley\nPulls across to greet a fellow rolling stone\nPuts his bike up on it's stand\nLeans back and then extends\nA scarred and greasy hand...he said\nHe said, how ya doin bro?\nWhere ya been?\nWhere ya goin'?\nThen he takes your hand\nIn some strange Californian handshake\nAnd breaks the bone\n[Whiny person:] \"Have a nice day, hehe\"A housewife from Encino\nWhose husband's on the golf course\nWith his book of rules\nBreaks and makes a 'U' and idles back\nTo take a second look at you\nYou flex your rod\nFish takes the hook\nSweet vodka and tobacco in her breath\nAnother number in your little black bookThese are the pros and cons of hitchhiking\nThese are the pros and cons of hitchhiking\nOh babe, I must be dreamingI'm standing on the leading edge\nThe Eastern seaboard spread before my eyes\nJump, says Yoko Ono\nI'm too scared and too good looking, I cried\nGo on, she says\nWhy don't you give it a try?\nWhy prolong the agony all men must die\nDo you remember Dick Tracy?\nDo you remember Shane?\n[Child:] \"And mother wants you.\"\nCould you see him selling tickets\nWhere the buzzard circles over\n[Child:] \"Shane.\"\nThe body on the plain\nDid you understand the music Yoko\nOr was it all in vain?\n[Child:] \"Shane...\"\nThe bitch said something mystical\n(Herro)\nSo I stepped back on the kerb again", 
        "url": "http://www.metrolyrics.com/the-pros-and-cons-of-hitchhiking-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "So we left Beirut Willa and I\nHe headed East to Baghdad and the rest of it\nI set out North\nI walked the five or six miles to the last of the street lamps\nAnd hunkered in the curb side dusk\nHolding out my thumb\nIn no great hope at the ramshackle procession of home bound traffic\nSuccess!\nAn ancient Mercedes 'dolmus '\nThe ubiquitous, Arab, shared taxi drew up\nI turned out my pockets and shrugged at the driver\n\" J'ai pas de l'argent \"\n\" Venez! \" A soft voice from the back seat\nThe driver lent wearily across and pushed open the back door\nI stooped to look inside at the two men there\nOne besuited, bespectacled, moustached, irritated, distant, late\nThe other, the one who had spoken,\nFrail, fifty five-ish, bald, sallow, in a short sleeved pale blue cotton shirt\nWith one biro in the breast pocket\nA clerk maybe, slightly sunken in the seat\n\"Venez!\" He said again, and smiled\n\"Mais j'ai pas de l'argent\"\n\"Oui, Oui, d'accord, Venez!\"Are these the people that we should bomb\nAre we so sure they mean us harm\nIs this our pleasure, punishment or crime\nIs this a mountain that we really want to climb\nThe road is hard, hard and long\nPut down that two by four\nThis man would never turn you from his door\nOh George! Oh George!\nThat Texas education must have fucked you up when you were very smallHe beckoned with a small arthritic motion of his hand\nFingers together like a child waving goodbye\nThe driver put my old Hofner guitar in the boot with my rucksack\nAnd off we went\n\" Vous etes Francais, monsieur? \"\n\" Non, Anglais \"\n\" Ah! Anglais \"\n\" Est-ce que vous parlais Anglais, Monsieur? \"\n\"Non, je regrette\"\nAnd so on\nIn small talk between strangers, his French alien but correct\nMine halting but eager to please\nA lift, after all, is a lift\nLate moustache left us brusquely\nAnd some miles later the dolmus slowed at a crossroads lit by a single lightbulb\nSwung through a U-turn and stopped in a cloud of dust\nI opened the door and got out\nBut my benefactor made no move to follow\nThe driver dumped my guitar and rucksack at my feet\nAnd waving away my thanks returned to the boot\nOnly to reappear with a pair of alloy crutches\nWhich he leaned against the rear wing of the Mercedes.\nHe reached into the car and lifted my companion out\nOnly one leg, the second trouser leg neatly pinned beneath a vacant hip\n\" Monsieur, si vous voulez, ca sera un honneur pour nous\nSi vous venez avec moi a la maison pour manger avec ma femme \"When I was 17 my mother, bless her heart, fulfilled my summer dream\nShe handed me the keys to the car\nWe motored down to Paris, fuelled with Dexedrine and booze\nGot bust in Antibes by the cops\nAnd fleeced in Naples by the wops\nBut everyone was kind to us, we were the English dudes\nOur dads had helped them win the war\nWhen we all knew what we were fighting for\nBut now an Englishman abroad is just a US stooge\nThe bulldog is a poodle snapping round the scoundrel's last refuge\"Ma femme\", thank God! Monopod but not queer\nThe taxi drove off leaving us in the dim light of the swinging bulb\nNo building in sight\nWhat the hell\n\"Merci monsieur\"\n\"Bon, Venez!\"\nHis faced creased in pleasure, he set off in front of me\nSwinging his leg between the crutches with agonising care\nUp the dusty side road into the darkness\nAfter half an hour we'd gone maybe half a mile\nWhen on the right I made out the low profile of a building\nHe called out in Arabic to announce our arrival\nAnd after some scuffling inside a lamp was lit\nAnd the changing angle of light in the wide crack under the door\nSignalled the approach of someone within\nThe door creaked open and there, holding a biblical looking oil lamp\nStood a squat, moustached woman, stooped smiling up at us\nShe stood aside to let us in and as she turned\nI saw the reason for her stoop\nShe carried on her back a shocking hump\nI nodded and smiled back at her in greeting, fighting for control\nThe gentleness between the one-legged man and his monstrous wife\nAlmost too much for meIs gentleness too much for us\nShould gentleness be filed along with empathy\nWe feel for someone else's child\nEvery time a smart bomb does its sums and gets it wrong\nSomeone else's child dies and equities in defence rise\nAmerica, America, please hear us when we call\nYou got hip-hop, be-bop, hustle and bustle\nYou got Atticus Finch\nYou got Jane Russell\nYou got freedom of speech\nYou got great beaches, wildernesses and malls\nDon't let the might, the Christian right, fuck it all up\nFor you and the rest of the worldThey talked excitedly\nShe went to take his crutches in routine of care\nHe chiding, gestured\nWe have a guest\nShe embarrassed by her faux pas\nTook my things and laid them gently in the corner\n\"Du the?\"\nWe sat on meagre cushions in one corner of the single room\nThe floor was earth packed hard and by one wall a raised platform\nSome six foot by four covered by a simple sheet, the bed\nThe hunchback busied herself with small copper pots over an open hearth\nAnd brought us tea, hot and sweet\nAnd so to dinner\nFlat, unleavened bread, + thin\nCooked in an iron skillet over the open hearth\nThen folded and dipped into the soft insides of female sea urchins\nMy hostess did not eat, I ate her dinner\nShe would hear of nothing else, I was their guest\nAnd then she retired behind a curtain\nAnd left the men to sit drinking thimbles full of Arak\nCarefully poured from a small bottle with a faded label\nSoon she reappeared, radiant\nCarrying in her arms their pride and joy, their child.\nI'd never seen a squint like that\nSo severe that as one eye looked out the other disappeared behind its noseNot in my name, Tony, you great war leader you\nTerror is still terror, whosoever gets to frame the rules\nHistory's not written by the vanquished or the damned\nNow we are Genghis Khan, Lucretia Borghia, Son of Sam\nIn 1961 they took this child into their home\nI wonder what became of them\nIn the cauldron that was Lebanon\nIf I could find them now, could I make amends?\nHow does the story end?And so to bed, me that is, not them\nOf course they slept on the floor behind a curtain\nWhilst I lay awake all night on their earthen bed\nThen came the dawn and then their quiet stirrings\nCareful not to wake the guest\nI yawned in great pretence\nAnd took the proffered bowl of water heated up and washed\nAnd sipped my coffee in its tiny cup\nAnd then with much \"merci-ing\" and bowing and shaking of hands\nWe left the woman to her chores\nAnd we men made our way back to the crossroads\nThe painful slowness of our progress accentuated by the brilliant morning light\nThe dolmus duly reappeared\nMy host gave me one crutch and leaning on the other\nShook my hand and smiled\n\"Merci, monsieur,\" I said\n\" De rien \"\n\" And merci a votre femme, elle est tres gentille \"\nGiving up his other crutch\nHe allowed himself to be folded into the back seat again\n\"Bon voyage, monsieur,\" he said\nAnd half bowed as the taxi headed south towards the city\nI turned North, my guitar over my shoulder\nAnd the first hot gust of wind\nQuickly dried the salt tears from my young cheeks.", 
        "url": "http://www.metrolyrics.com/leaving-beirut-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Daddy's flown across the ocean\nLeaving just a memory\nSnapshot in the family album\nDaddy what else did you leave for me?\nDaddy, what'd'ja leave behind for me?!?\nAll in all it was just a brick in the wall.\nAll in all it was all just bricks in the wall.\"You! Yes, you! Stand still laddy!\"", 
        "url": "http://www.metrolyrics.com/another-brick-in-the-wall-pt1-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Hello, I love you, won't you tell me your name?\nHello, I love you, let me jump in your game\nHello, I love you, let me jump in your game\nWalking down the street, blind to every eye she meets\nDo you think you'll be the guy to make the queen of the angels sigh?Hello, I love you, won't you tell me your name?\nHello, I love you, let me jump in your game\nHello, I love you, let me jump in your game\nShe holds her head so high, like a statue in the sky\nHer arms are wicked, and her legs are long,\nwhen she moves my brain screams out this song\nSidewalk crouches at her feet, like a dog that begs for something sweet\nDo you hope to make her see you fool?\nDo you hope to pluck this dusky jewel?Hello, I love you, won't you tell me your name?\nHello, I love you, let me jump in your game", 
        "url": "http://www.metrolyrics.com/hello-i-love-you-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "An angel on a Harley\nPulls across to greet a fellow rolling stone\nPuts his bike up on it's stand\nLeans back and then extends\nA scarred and greasy hand...he said\nHe said, how ya doin bro?\nWhere ya been?\nWhere ya goin'?\nThen he takes your hand\nIn some strange Californian handshake\nAnd breaks the bone\n[Whiny person:] \"Have a nice day, hehe\"A housewife from Encino\nWhose husband's on the golf course\nWith his book of rules\nBreaks and makes a 'U' and idles back\nTo take a second look at you\nYou flex your rod\nFish takes the hook\nSweet vodka and tobacco in her breath\nAnother number in your little black bookThese are the pros and cons of hitchhiking\nThese are the pros and cons of hitchhiking\nOh babe, I must be dreamingI'm standing on the leading edge\nThe Eastern seaboard spread before my eyes\nJump, says Yoko Ono\nI'm too scared and too good looking, I cried\nGo on, she says\nWhy don't you give it a try?\nWhy prolong the agony all men must die\nDo you remember Dick Tracy?\nDo you remember Shane?\n[Child:] \"And mother wants you.\"\nCould you see him selling tickets\nWhere the buzzard circles over\n[Child:] \"Shane.\"\nThe body on the plain\nDid you understand the music Yoko\nOr was it all in vain?\n[Child:] \"Shane...\"\nThe bitch said something mystical\n(Herro)\nSo I stepped back on the kerb again", 
        "url": "http://www.metrolyrics.com/501-am-the-pros-and-cons-of-hitchhiking-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Momma loves her baby\nAnd Daddy loves her, too\nAnd the sea may look warm to ya, Baby\nAnd the sky may look blue\nBabyBaby Blue\nBaby\nIf you should go skating\nOn the thin ice of modern lifeDragging behind you the silent reproach\nOf a million tear-stained eyes\nDon't be surprised when a crack in the ice\nAppears under your feetYou slip out of your depth and out of your mind\nWith your fear flowing out from behind you\nAs you claw the ice", 
        "url": "http://www.metrolyrics.com/the-thin-ice-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "(Apparently they were travelling abroad)\n(And they picked up some hitchhikers)\n[Jade:] \"Oh God....\"\n[Wife:] \"Wake up you're dreaming.\"\n[Jade:] \"What?\"\n[Wife:] \"You're dreaming.\"\n[Jade:] \"We were moving away from the border.\"\n[Wife:] \"Huh, what border?\"\n[Jade:] \"Have a nice day.\"\n[Wife:] \"Huh?\"\n[Jade:] \"Have a nice day.\"We were moving away from the border\nLooking for somewhere to sleep\nThe two of us sharing the driving\nTwo hitchhikers slumped in the back seat\n[Woman:] \"Hello\"\nI sneaked a quick look in the mirror\nShe gave me a smile\nI said, is anyone hungry?\nShould we stop for a while?\nSo we pulled off into a layby\nHer dress blew up over her head\nI said, would you like to come with me?\nShe said something foreign under her breath\n[Woman:] \"(foreign words)\"\nAnd the sun shone down on her lovely young limbs\nI thought to myself she's much too good for you\nI lay down beside her with tears in my eyes\nShe said", 
        "url": "http://www.metrolyrics.com/430-am-apparently-they-were-travelling-abroad-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Can't you see\nIt all makes perfect sense\nExpressed in dollars and cents\nPounds shillings and pence\nCan't you see\nIt all makes perfect sense\nLittle black soul departs in perfect focus\nPrime time fodder for the News at Nine\nDarling is the child warm in the bed tonight\nHi everybody I'm Marv Albert\nAnd welcome to our telecast\nComing to you live from Memorial Stadium\nIt's a beautiful day\nAnd today we except a sensational matchup\nBur first our global anthem\nCan't you see\nIt all makes perfect sense\nExpressed in dollars and cents\nPounds shillings and pence\nCan't you see\nIt all makes perfect sense\nAnd here come the players\nAs I speak to you now the captain\nHas he cross hairs zeroed on the oil rig\nIt looks to me like he's going to attack\nBy the way did you know that a submarine\nCaptain earns two hundred thousand dollars a year\nOh that's less tax Marv less tax\nUh thank you Emery you're welcome\nNow back to the game he fires one yes\nThere goes two both fish are running\nThe rig is going into a prevent defense\nWill they make it I don't think so\nCan't you see\nIt all makes perfect sense\nExpressed in dollars and cents\nPounds shillings and pence\nCan't you see\nIt all makes perfect sense", 
        "url": "http://www.metrolyrics.com/perfect-sense-part-ii-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Remember when you were young\nYou shone like the sun\nShine on you crazy diamond\nNow there's a look in your eyes\nLike black holes in the sky\nShine on you crazy diamond\nYou were caught in the crossfire\nOf childhood and stardom\nBlown on the steel breeze\nCome on you target for faraway laughter\nCome on you stranger\nYou legend\nYou martyr\nAnd shineYou reached for the secret too soon\nYou cried for the moon\nShine on you crazy diamond\nThreatened by shadows at night\nAnd exposed in the light\nShine on you crazy diamond\nWell, you wore out your welcome\nWith random precision\nRode on the steel breeze\nCome on you raver\nYou seer of visions\nCome on you painter\nYou piper\nYou prisoner\nAnd shineNobody knows where you are\nHow near or how far\nShine on you crazy diamond\nPile on many more years\nAnd I'll be joining you there\nShine on you crazy diamond\nAnd we'll bask in the shadow\nOf yesterday's triumph\nSail on the steel breeze\nCome on you boy child\nYou winner and loser\nCome on you miner for truth and delusion\nAnd shine", 
        "url": "http://www.metrolyrics.com/shine-on-you-crazy-diamond-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "They disembarked in '45\nAnd no one spoke\nAnd no one smiled\nThere were too many spaces in the line\nAnd gathered at the cenotaph\nThey all agreed with hand on heart\nTo sheath the sacrificial knives\nBut now\nShe stands upon Southampton dock\nWith her handkerchief\nAnd her summer frock\nClings to her wet body in the rain\nIn quiet desperation\nKnuckles white upon the slippery reins\nShe bravely waves the boys goodbye again\nOoo, Maggie what have you done?\nAnd still the dark stain spreads between\nTheir shoulder blades\nA mute reminder\nOf the poppy fields and graves\nWhen the fight was over\nWe spent what they had made\nBut\nIn the bottom of our hearts\nWe felt the final cut", 
        "url": "http://www.metrolyrics.com/southampton-dock-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "We were watching T.V.\nWatching T.V.\nWe were Watching T.V.\nWatching T.V.In Tiananmen Square\nLost my baby there\nMy yellow rose\nIn her bloodstained clothesShe was a short order pastry chef\nIn a Dim Sum dive on the Yangtze tideway\nShe had shiny hair\nShe was the daughter of an engineerWon't you shed a tear\nFor my yellow rose\nMy yellow rose\nIn her bloodstained clothesShe had perfect breasts\nShe had high hopes\nShe had almond eyes\nShe had yellow thighsShe was a student of philosophy\nWon't you grieve with me\nFor my yellow rose\nShed a tearFor her bloodstained clothes\nShe had shiny hair\nShe had perfect breasts\nShe had high hopesShe had almond eyes\nShe had yellow thighs\nShe was the daughter of an engineer\nSo get out your pistolsGet out your stones\nGet out your knives\nCut them to the bone\nThey are the lackeys of the grocer's machineThey built the dark satanic mills\nThat manufacture hell on earth\nThey bought the front row seats on Calvary\nThey are irrelevant to meBut I grieve for my sister\nPeople of China\nDo not forget do not forget\nThe children who died for youLong live the Republic\nDid we do anything after this\nI've a feeling we did\nWe were watching T.V.Watching T.V.\nWe were watching T.V.\nWatching T.V.\nShe wore a white bandanna that saidFreedom now\nShe thought the Great Wall of China\nWould come tumbling down\nShe was a studentHer father was an engineer\nWon't you shed a tear\nFor my yellow rose\nMy yellow roseIn her bloodstained clothes\nHer grandpa fought old Chiang Kai-shek\nThat no-good low-down dirty rat\nWho used to order his troopsTo fire on the women and children\nImagine that imagine that\nAnd in the spring of '48\nMao Tse-tung got quite irateAnd he kicked that old dictator Chiang\nOut of the state of China\nChiang Kai-shek came down in Formosa\nAnd they armed the island of QuemoyAnd the shells were flying across the China Sea\nAnd they turned Formosa into a shoe factory\nCalled Taiwan\nAnd she is different from Cro-Magnon manShe's different from Anne Boleyn\nShe is different from the Rosenbergs\nAnd from the unknown Jew\nShe is different from the unknown NicaraguanHalf superstar half victim\nShe's a victor star conceptually new\nAnd she is different from the Dodo\nAnd from the KankanbonoShe is different from the Aztec\nAnd from the Cherokee\nShe's everybody's sister\nShe's symbolic of our failureShe's the one in fifty million\nWho can help us to be free\nBecause she died on T.V.\nAnd I grieve for my sister", 
        "url": "http://www.metrolyrics.com/watching-tv-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Mama, take this badge off of me\n'Cause I can't use it anymore\nIt's gettin' dark, too dark to see\nI feel like I'm knockin' on Heaven's doorKnock, knock, knockin' on Heaven's door\nKnock, knock, knockin' on Heaven's door\nKnock, knock, knockin' on Heaven's door\nKnock, knock, knockin' on Heaven's doorMama, put these guns in the ground\n'Cause I can't shoot them anymore\nThat long dark cloud is coming down\nI feel like I'm knockin' on heaven's doorKnock, knock, knockin' on Heaven's door\nKnock, knock, knockin' on Heaven's door\nKnock, knock, knockin' on Heaven's door\nKnock, knock, knockin' on Heaven's doorKnock, knock, knockin' on Heaven's door\nKnock, knock, knockin' on Heaven's door\nKnock, knock, knockin' on Heaven's door\nKnock, knock, knockin' on Heaven's doorKnock, knock, knockin' on Heaven's door\nKnock, knock, knockin' on Heaven's door", 
        "url": "http://www.metrolyrics.com/knockin-on-heavens-door-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "\"I don't mind about the war, that's one of the things I like to watch, if it's a war going on, 'cause then I know if our side's winning, if our side's losing...\"\n(switch channels)\nWhat God wants God gets God help us all\nWhat God wants God gets (repeated)\nThe kid in the corner looked at the priest\nAnd fingered his pale blue Japanese guitar\nThe priest said:God wants goodness\nGod wants light\nGod wants mayhem\nGod wants a clean fightWhat God wants God gets\nDon't look so surprised\nIt's only dogma\nThe alien prophet cried\nThe beetle and the springbok\nTook the Bible from its hook\nThe monkey in the corner\nWrote the lesson in his book\nWhat God wants God gets God help us allGod wants peace\nGod wants war\nGod wants famine\nGod wants chain storesWhat God wants God getsGod wants sedition\nGod wants sex\nGod wants freedom\nGod wants semtexWhat God wants God gets\nDon't ok so surprised\nI'm only joking\nThe alien comic cried\nThe jackass and hyena\nTook the feather from its hook\nThe monkey in the corner\nWrote the joke down in his book\nWhat God wants God getsGod wants borders\nGod wants crack\nGod wants rainfall\nGod wants wetbacksWhat God wants God getsGod wants voodoo\nGod wants shrines\nGod wants law\nGod wants organised crime\nGod wants crusade\nGod wants jihad\nGod wants good\nGod wants badWhat God wants God Gets", 
        "url": "http://www.metrolyrics.com/what-god-wants-part-iii-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "By Roger Waters\nYou gotta be crazy, you gotta have a real need\nYou gotta sleep on your toes, and when you're on the street\nYou gotta be able to pick out the easy meat with your eyes closed\nAnd then moving in silently, down wind and out of sight\nYou gotta strike when the moment is right without thinking.And after a while, you can work on points for style\nLike the club tie, and the firm handshake\nA certain look in the eye, and an easy smile\nYou have to be trusted by the people that you lie to\nSo that when they turn their backs on you\nYou'll get the chance to put the knife in.You gotta keep one eye looking over your shoulder\nYou know it's going to get harder, and harder, and harder as you get older\nAnd in the end you'll pack, fly down south\nHide your head in the sand\nJust another sad old man\nAll alone and dying of cancer.And when you loose control, you'll reap the harvest that you've own\nAnd as the fear grows, the bad blood slows and turns to stone\nAnd it's too late to loose the weight you used to need tothrowaround\nSo have a good drown, as you go down alone\nDragged down by the stone.I gotta admit that I'm a little bit confused\nSometimes it seems to me as if I'm just being used\nGotta stay awake, gotta try and shake of this creeping malaise\nIf I don't stand my own ground, how can I find my way out ofthismaze?Deaf, dumb, and blind, you just keep on pretending\nThat everyone's expendable and no-one had a real friend\nAnd it seems to you the thing to do would be to is late the winner\nAnd you believe at heart, everyone's a killer.Who was ...\nby DN2is", 
        "url": "http://www.metrolyrics.com/dogs-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "All in all it's just another brick in the wall\nAll in all you're just another brick in the wallJust another blunder\nJust another lousy call\nJust another clap of thunderAnd apologies ring hollow\nFrom the guilty in Whitehall\nAnd there's no hint of sorrow\nIn the whitewash on the wallAnd nothing is gained\n(Nothing at all) And Jean Charles de Menezes remains\nJust another brick in the wall", 
        "url": "http://www.metrolyrics.com/the-ballad-of-jean-charles-de-menezes-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "I like staying with my Uncle Dave\nAnd I like playing with his great dane\nBut I don't fit\nI feel alien and strange Kinda out of rangeI like riding in my Uncle's car\nDown to the beach where the pretty girls all\nparade\nAnd movie stars and paparazzi play\nThe Charles Atlas kicking sand in the face gameAnd I sit in the canyon with my back to the sea\nThere's a blood red dragon on a field of green\nCalling me backBack to the Black Hills again\nOoh, ooh, Billy come homeBilly is searching for his native land\nFlicking through the stations with the dial in his\nhead\nPicking up, andBilly taps out Jim's number on the 'phone\nSits shaking as he waits for Jim's answering tone\nCome on my friend, speak to me please\nThe land of my fathers is calling to me\nAnd I sit in the canyon with my back to the sea\nThere's a blood red dragon on a field of green\nCalling me back, back to the Black Hills again\nOoh, ooh, Billy come homeCome on home\nHe sits in the canyon with his back to the sea\nSees a blood red dragon on a field of green\nHe hears a male voice choir singing Billy come\nhome\nBilly, Billy, come home\nCome on homeI don't like fish.\nYou are listening to KAOS here in Los Angeles.\nI don't like fish.\nYes, we've established that. Ah! Do you have a request?\nShell fish, guppy, salmon, shrimp and crab and lobster, flounder.I hate fish, but I think most of all I hate fresh fish, like trout. I hate fresh trout. My least-hated, favourite fish would be sole. That way you don't have to see the eyes. Sole has no eyes.\nOh no!\nI'd like to be home with my monkey and my dog\nThank you.\nI'd like to be home with my monkey and my dog I'd like to be home with my monkey and my dog I'd like to be home with my monkey ...\nThey don't care. Shut up. Play the record.", 
        "url": "http://www.metrolyrics.com/sunset-strip-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Daddy's flown across the ocean\nLeaving just a memory\nSnapshot in the family album\nDaddy what else did you leave for me?\nDaddy, what'd'ja leave behind for me?!?\nAll in all it was just a brick in the wall.\nAll in all it was all just bricks in the wall.\"You! Yes, you! Stand still laddy!\"", 
        "url": "http://www.metrolyrics.com/another-brick-in-the-wall-part-i-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "(Geesin)(....Adam, Adam, ....)\n(harmonizing voices)", 
        "url": "http://www.metrolyrics.com/more-than-seven-dwarfs-in-penisland-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "", 
        "url": "http://www.metrolyrics.com/what-god-wants-pt-2-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "When my neurons conspire to direct my thoughts\nAway from divorce and competitive sports\nBack to the place where all rivers run to the sea\nThen I shall be free\nYes I shall be freeOn a see-saw in a strange land\nThe jackdaw sat on the Cardinal's hand\nAnd the fiddlers played\nAnd the planners plan what would be\nOn a back seat in a court room\nSat Molly Malone and Leopold Bloom\nUntil the police came down with a new broom\nAnd swept them cleanLike Geronimo\nLike Quinn the Eskimo\nLike the Blackfoot\nAnd like the Arapaho\nLike Crazy Horse\nI'll be the last one to lay down my gunOn the open road in a bar room\nA pick up band plays a new tune\nWhen the coloured girls sing\nI feel my heart boom\nWhen a new song hits the right note\nWhen a clearing sky saves an old boat\nWhen an insight strikes the mote\nFrom mine own eyeLike Geronimo\nLike Quinn the Eskimo\nLike the Blackfoot\nAnd like the Arapaho\nLike Crazy Horse\nI'll be the last one to lay down my gunJust out of sight\nBeyond the next range\nI'll feel the heat of a flickering flameOn an African Plain by a thorn tree\nMy old friend Philippe is waiting for me\nQue cera, cera\nWhat ever will be will be\nWhen a friend dies and the tears rise\nFrom that deep well that never runs dry\nAnd the women break their bracelets\nAnd the men take their whisky outsideIn a pied-a-terre on the rue St Denis\nThe red velvet curtain pulls back to reveal\nThe place where the dark side meets the angel in me\nThe angel in meWhen my synapses pause in my quest for applause\nWhen my ego lets go of my end of the bone\nTo focus instead on the love that is precious to me\nThen I shall be free\nI shall be free", 
        "url": "http://www.metrolyrics.com/flickering-flame-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Is there anybody out there?\nIs there anybody out there?\nIs there anybody out there?\nIs there anybody out there?", 
        "url": "http://www.metrolyrics.com/is-there-anybody-out-there-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Note: This song appears to be about 3 seconds long\n(Russian's speaking over radio)\n(Instrumental)", 
        "url": "http://www.metrolyrics.com/the-russian-missile-waters-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Got a little black book with my poems in,\nGot a bag with a toothbrush and a comb in.\nWhen I'm a good dog they sometimes throw me a bone in.\nI got elastic bands keeping my shoes on,Got those swollen hand blues,\nGot thirteen channels of shit on the TV to choose from.\nI got electric light, and I got second sight.\nGot amazing powers of observation.And that is how I know\nWhen I try to get through on the telephone to you,\nThere'll be nobody home.\nI got the obligatory Hendrix permAnd the inevitable pinhole burns\nAll down the front of my favorite satin shirt.\nI got nicotine stains on my fingers,\nI got a silver spoon on a chain.Got a grand piano to prop up my mortal remains.\nI got wild staring eyes,\nAnd I got a strong urge to fly,\nBut I got nowhere to fly to(fly to, fly to, fly to, fly to, fly to, fly to, fly to).\nOooooh, babe, when I pick up the phone,\nThere's still nobody home.\nI got a pair of Gohill's boots,\nAnd I got fading roots", 
        "url": "http://www.metrolyrics.com/nobody-home-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "All that you touch\nAnd all that you see\nAll that you taste\nAnd all you feelAll that you love\nAnd all that you hate\nAll you distrust\nAnd all you saveAnd all that you give\nAnd all that you deal\nAnd all that you buy,\nBeg, borrow or stealAnd all you create\nAnd all you destroy\nAnd all that you do\nAnd all that you sayAnd all that you eat\nAnd everyone you meet\nAnd all that you slight\nAnd everyone you fightAnd all that is now\nAnd all that is gone\nAnd all that's to come\nAnd everything under the sun is in tune\nBut the sun is eclipsed by the moon", 
        "url": "http://www.metrolyrics.com/eclipse-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Can't you see\nIt all makes perfect sense\nExpressed in dollars and cents\nPounds shillings and pence\nCan't you see\nIt all makes perfect sense\nLittle black soul departs in perfect focus\nPrime time fodder for the News at Nine\nDarling is the child warm in the bed tonight\nHi everybody I'm Marv Albert\nAnd welcome to our telecast\nComing to you live from Memorial Stadium\nIt's a beautiful day\nAnd today we except a sensational matchup\nBur first our global anthem\nCan't you see\nIt all makes perfect sense\nExpressed in dollars and cents\nPounds shillings and pence\nCan't you see\nIt all makes perfect sense\nAnd here come the players\nAs I speak to you now the captain\nHas he cross hairs zeroed on the oil rig\nIt looks to me like he's going to attack\nBy the way did you know that a submarine\nCaptain earns two hundred thousand dollars a year\nOh that's less tax Marv less tax\nUh thank you Emery you're welcome\nNow back to the game he fires one yes\nThere goes two both fish are running\nThe rig is going into a prevent defense\nWill they make it I don't think so\nCan't you see\nIt all makes perfect sense\nExpressed in dollars and cents\nPounds shillings and pence\nCan't you see\nIt all makes perfect sense", 
        "url": "http://www.metrolyrics.com/perfect-sense-pt12-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "An angel on a Harley\nPulls across to greet a fellow rolling stone\nPuts his bike up on it's stand\nLeans back and then extends\nA scarred and greasy hand...he said\nHe said, how ya doin bro?\nWhere ya been?\nWhere ya goin'?\nThen he takes your hand\nIn some strange Californian handshake\nAnd breaks the bone\n\"Have a nice day, hehe\"A housewife from Encino\nWhose husband's on the golf course\nWith his book of rules\nBreaks and makes a 'U' and idles back\nTo take a second look at you\nYou flex your rod\nFish takes the hook\nSweet vodka and tobacco in her breath\nAnother number in your little black bookThese are the pros and cons of hitchhiking\nThese are the pros and cons of hitchhiking\nOh babe, I must be dreamingI'm standing on the leading edge\nThe Eastern seaboard spread before my eyes\nJump, says Yoko Ono\nI'm too scared and too good looking, I cried\nGo on, she says\nWhy don't you give it a try?\nWhy prolong the agony all men must die\nDo you remember Dick Tracy?\nDo you remember Shane?\n\"And mother wants you.\"\nCould you see him selling tickets\nWhere the buzzard circles over\n\"Shane.\"\nThe body on the plain\nDid you understand the music Yoko\nOr was it all in vain?\n\"Shane...\"\nThe bitch said something mystical\n(Herro)\nSo I stepped back on the kerb again", 
        "url": "http://www.metrolyrics.com/pros-and-cons-of-hitch-hiking-part-11-aka-506-am-every-stranges-eye-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Remember when you were young, you shone like the sun.Shine on you crazy diamond.\nNow there's a look in your eyes, like black holes in the sky.\nShine on you crazy diamond.\nYou were caught on the cross fire of childhood and stardom,\nBlown on the steel breeze.\nCome on you target for faraway laughter, come on you stranger,\nYou legend, you martyr, and shine!You reached for the secret too soon, you cried for the moon.\nShine on you crazy diamond.\nThreatened by shadows at night, and exposed in the light.\nShine on you crazy diamond.\nWell you wore out your welcome with random precision,\nRode on the steel breeze.\nCome on you raver, you seer of visions, come on you painter,\nYou piper, you prisoner, and shine!Nobody knows where you are, how near or how far.\nShine on you crazy diamond.\nPile on many more layers and I'll be joining you there.\nShine on you crazy diamond.\nAnd we'll bask in the shadow of yesterday's triumph,\nAnd sail on the steel breeze.\nCome on you boy child, you winner and loser,\nCome on you miner for truth and delusion, and shine!", 
        "url": "http://www.metrolyrics.com/shine-on-you-crazy-diamond-pts18-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "You! Yes you! Stand still laddy!When we grew up and went to school\nThere were certain teachers\nWho would hurt the children any way they could\nBy pouring their derision upon anything we did\nExposing every weakness\nHowever carefully hidden by the kidsBut in the town it was well known\nWhen they got home at night\nTheir fat and psychopathic wives would thrash them\nWithin inches of their lives", 
        "url": "http://www.metrolyrics.com/happiest-days-of-our-lives-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Welcome my son\nWelcome to the machine\nWhere have you been?\nIt's alright we know where you've been\nYou've been in the pipeline\nFilling in time\nProvided with toys and scouting for boys\nYou bought a guitar to punish your ma\nAnd you didn't like school\nAnd you know you're nobody's fool\nSo welcome to the machine\nWelcome to the machineWelcome my son\nWelcome to the machine\nWhat did you dream?\nIt's alright we told you what to dream\nYou dreamed of a big star\nHe played a mean guitar\nAnd he always ate in the steak bar\nAnd he loved to drive in his Jaguar\nSo welcome to the Machine", 
        "url": "http://www.metrolyrics.com/welcome-to-the-machine-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "\"Oh my God, what a fabulous room!\n\"Are all these your guitars?\"\n\"I'm sorry sir, I didn't mean to startle you!\"\n\"God, this place is bigger than our apartment.\"\n\"Uh, could I get a drink of water?\"\n\"Let me know when you are entering a room\" Yes sir!\"\n\"Ya want some? Huh?\"\n\"Yes\"\n\"Oh wow! Look at this tub!\"You wanna take a bath?\"\n\"I'll have to find out from Mrs. Bancroft what time she wants to meet us, for here main\"\n\"What're you watching?\"\n\"If you'll just let me know as soon as you can\nMrs. Bancroft. Mrs. Bancroft\"\n\"Hello?\"\n\"I don't understand\"\n\"Are you feeling OK?\"", 
        "url": "http://www.metrolyrics.com/oh-my-god-what-a-fabulous-room-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "", 
        "url": "http://www.metrolyrics.com/what-god-wants-pt-ii-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "\"Hammer, Hammer, Hammer,...\"\n[Pink:] \"Einse, svei, drei, alle!\"Oooo, You cannot reach me now\nOooo, No matter how you try\nGoodbye cruel world, it's over\nWalk on bySitting in a bunker\nHere behind my wall\nWaiting for the worms to come\nIn perfect isolation\nHere behind my wall\nWaiting for the worms to come[Man using megaphone:] \"We're waiting to succeed and going to convene outside Brixton Town Hall where we're going to be...\"\nWaiting, to cut out the deadwood\nWaiting, to clean up the city\nWaiting, to follow the worms\nWaiting, to put on a black shirt\nWaiting, to weed out the weaklings\nWaiting, to smash in their windows\nAnd kick in their doors\nWaiting, for the final solution to strengthen the strain\nWaiting, to follow the worms\nWaiting, to turn on the showers and fire the ovens\nWaiting, for the queers and the coons\nAnd the Reds and the Jews\nWaiting, to follow the worms", 
        "url": "http://www.metrolyrics.com/waiting-for-the-worms-stop-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "I used to think the world was flat\nRarely threw my hat into the crowd\nI felt I had used up my quota of yearning\nUsed to look in on the children at nightIn the glow of their Donald Duck light\nAnd frighten myself with the thought of my little ones burning\nBut, oh, oh, oh, the tide is turning\nThe tide is turningSatellite buzzing through the endless night\nExclusive to moonshots and world title fights\nJesus Christ imagine what it must be earning\nWho is the strongestWho is the best\nWho holds the aces\nThe East\nOr the WestThis is the crap our children are learning\nBut oh, oh, oh, the tide is turning\nThe tide is turning\nOh, oh, oh, the tide is turningNow the satellite's confused\n'Cause on Saturday night\nThe airwaves were full of compassion and light\nAnd his silicon heart warmedTo the sight of a billion candles burning\nOo, oo, oo, the tide is turning\nOo, oo, oo, the tide is turning\nThe tide is turning BillyI'm not saying that the battle is won\nBut on Saturday night all those kids in the sun\nWrested technology's sword from the hand of the war lords\nOh, oh, oh, the tide is turningThe tide is turning Sylvester\nThe tide is turning\n\"That's it!\nNow the past is over but you are not aloneTogether we'll fight Sylvester Stallone\nWe will not be dragged down in his South China Sea\nOf macho bullshit and mediocrity\"", 
        "url": "http://www.metrolyrics.com/the-tide-is-turning-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "Seashell and stone\nSurf rushes forward to feel the shingle with fingers of foam\nSearch for the gold\nOver the landscape the mouth of a lifeline unfolds\nSmooth and round and brown\nSee how the sunshine creeps over thistle and down\nHillock and hump, hummock and clump and mound\nI feel a lump, see a bump, hear a bulboba sound\nHollow and valley and shadow and dimple and hillGlisten and glimmer and shimmer and sparkle and still\nSunlight is warming the land before your eyes\nAnd the sunrise is on your side\nAnd the sunshine is on your thighs\nLady of stone, you are alone\nLady of stone, you are alone", 
        "url": "http://www.metrolyrics.com/sea-shell-an-stone-lyrics-roger-waters.html"
    }, 
    {
        "lyrics": "I just cowered in the corner\nMy pyjama coat over my head\nAnd she smiled as she finished her sandwich\nAnd her cold eyes fixed me to my dark history\nAs she brushed the remains\nOf our love from the bed\nAnd when she had turned back the covers\nWhen all of the prayers had been read\nShe said, come on over here you silly boy\nBefore you catch your death of cold\nI was only joking\nLet's leave behind the city grime\nLet's not compete\nIt could be fine in the country\nCouldn't it though...come on lets go\nI said, OK[Young Child:] \"Are we going to go now?\"\n[Jade:] \"Where would you like to go darling?\"\n[Wife:] \"Mmm...Vermont...Wyoming.\"\n[Jade:] \"Wyoming...huh....Children!\"\n[Children:] \"What?\"\n[Jade:] \"We're going to Wyoming\nDarling...Which way is Wyoming?\"\n[Wife:] \"Hook a right here\nYou're going the wrong way.\"\n[Jade:] \"I know that\nI know children...\nLet's see how many...Volvos we pass\nOn the way to our new life in the country\n...One\n[Wife:] \"Jade, don't do that, that's really negative.\"", 
        "url": "http://www.metrolyrics.com/447-am-the-remains-of-our-love-lyrics-roger-waters.html"
    }
]